

//Задача 37: 

//Найдите произведение пар чисел в одномерном массиве. 

//Парой считаем первый и последний элемент, второй и предпоследний и т.д. 

//Результат запишите в новом массиве.

//СДЕЛАТЬ МИНИМУМ ТРИ МЕТОДА

int Getval(string text) //  1. Считывание данных от пользователя 
   1. Считать int число
   int <- string
{
    return Convert.Toint32(text);
}














Console.WriteLine("Введите длину массива: ");
int length = GetVal(Console.ReadLine());
